Repository: RedTurtle/rt.bulkmodify
Catalog: rt/bulkmodify/locales/*/LC_MESSAGES/rt.bulkmodify.po
Languages: it

source: An administration tool for performing mass text substitution on Plone contents
it: Uno strumento di amministrazione per eseguire sostituzione di massa su contenuti Plone

source: An error has occurred
it: Si è verificato un errore

source: Bulk modify
it: Sostituzioni di massa

source: Bulk modify contents
it: Modifiche in blocco dei contenuti

source: Bulk replace
it: Sostituzioni in blocco

source: Bulk text replacement
it: Sostituzione in blocco del testo

source: Change done
it: Modifica eseguita

source: Choose whether you also want to search for static content portlets
it: Scegli se vuoi anche ricercare all'interno di portlet di testo statico

source: Content types
it: Tipi di contenuto

source: Continue
it: Continua

source: Create a new version (if possible)
it: Crea una nuova versione (se possibile)

source: Do not update anything (silent change)
it: Non aggiornare nulla (modifica silente)

source: Document
it: Documento

source: Error
it: Errore

source: Ignore case
it: Ignora maiuscole/minuscole

source: Include portlets
it: Includi riquadri

source: Modify selected
it: Modifica selezionati

source: Multiline
it: Multiriga

source: No results found
it: Nessun risultato trovato

source: Pause
it: Pausa

source: Please note!
it: Attenzione!

source: Read carefully notes below.
it: Leggere attentamente le note sottostanti.

source: Regex flags
it: Importazioni regex

source: Replace text
it: Sostituzione testo

source: Search
it: Cerca

source: Search regex
it: Espressione regolare di ricerca

source: Select all
it: Seleziona tutti

source: Select the kind of text replace you want to perform (if any)
it: Seleziona il tipo di sostituzione che vuoi eseguire (se voluta)

source: Text found
it: Testo trovato

source: Update modification time
it: Aggiorna data di modifica

source: Verbose
it: Verboso

source: View content
it: Vedi documento

source: a regex
it: un'espressione regolare

source: content_types_help
it: Seleziona l'insieme dei contenuti da ispezionare

source: default_replacement_type_help
it: Metodo di sostituzione predefinita. Usa il testo di sostituzione dal campo sotto

source: default_replacement_type_label
it: Sostituzione predefinita

source: documents checked
it: documenti verificati

source: painfully slow
it: estremamente lento

source: regex_flags_help
it: Opzioni dell'espressione regolare. Vedi la documentazione delle regex Python.

source: search_regex_help
it: Inserisci un'espressione regolare per eseguire la ricerca.

source: update_method_help
it: Usa i controlli sopra se vuoi anche modificare la data di ultima modifica o creare una nuova versione

source: utility_internal_link_to_uid_description
it: Se il risultato contiene un gruppo chiamato <url> e questo gruppo è un link ad un contenuto interno al sito, trasforma il link in una forma che usi resolveuid. Un buon esempio: <a [^>]*href="(?P<url>[^"]+)"[^>]+>

source: utility_internal_link_to_uid_name
it: Converti link interni all'uso di resolveuid

source: warning_msg_part1
it: Da questa pagina potrai eseguire ricerche usando ${regex_doc_link} dentro i contenuti del sito. Ogni ricerca che eseguirai risveglierà i contenuti del sito. Questo può essere ${heavy_note}, e rallentare la normale attività del sito.

source: warning_msg_part2
it: Ancor peggio: se eseguirai delle sostituzioni usando il campo "Sostituzione testo" sotto, verrà eseguita una scrittura sul database per ogni documento selezionato.

source: warning_msg_part3
it: Sii certo di cosa stai per fare
